Revit 2017 API
Plane Constructor
 Default constructor
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2016
Syntax
C#
[ObsoleteAttribute("This method is obsolete in Revit 2017. Please use Plane.Create() instead.")]
public Plane()
Visual Basic
<ObsoleteAttribute("This method is obsolete in Revit 2017. Please use Plane.Create() instead.")> _
Public Sub New
Visual C++
[ObsoleteAttribute(L"This method is obsolete in Revit 2017. Please use Plane.Create() instead.")]
public:
Plane()
See Also
Plane Class
Plane Overload
Autodesk.Revit.DB Namespace